{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 32, "kernel_size": [3, 3], "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "valid", "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "units": 128, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "name": "dense_2"}}], "name": "sequential_1"}, "keras_version": "2.2.4"}