{"config": {"name": "sequential_1", "layers": [{"config": {"strides": [1, 1], "batch_input_shape": [null, 64, 64, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "activation": "relu", "name": "conv2d_1", "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "units": 128, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "units": 1, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}